Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:AdjustPoint edc:_addr="0x40002C5C" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40002C64" edc:access="nnnnnnnnnnnnnnnn" edc:cname="PATTBUF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PGEB0" edc:desc="Pattern Generator 0 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB1" edc:desc="Pattern Generator 1 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB2" edc:desc="Pattern Generator 2 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB3" edc:desc="Pattern Generator 3 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB4" edc:desc="Pattern Generator 4 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB5" edc:desc="Pattern Generator 5 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB6" edc:desc="Pattern Generator 6 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGEB7" edc:desc="Pattern Generator 7 Output Enable Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB0" edc:desc="Pattern Generator 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB1" edc:desc="Pattern Generator 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB2" edc:desc="Pattern Generator 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB3" edc:desc="Pattern Generator 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB4" edc:desc="Pattern Generator 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB5" edc:desc="Pattern Generator 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB6" edc:desc="Pattern Generator 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGVB7" edc:desc="Pattern Generator 7 Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002C66" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x40002C6C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PERBUF" edc:impl="0xFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="PERBUF" edc:desc="Period Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C70" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF0" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="DITHERBUF" edc:desc="Dithering Buffer Cycle Number" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C74" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF1" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="DITHERBUF" edc:desc="Dithering Buffer Cycle Number" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C78" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF2" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="DITHERBUF" edc:desc="Dithering Buffer Cycle Number" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C7C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF3" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="DITHERBUF" edc:desc="Dithering Buffer Cycle Number" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C80" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF4" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="DITHERBUF" edc:desc="Dithering Buffer Cycle Number" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C84" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCBUF5" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="-20"/>
            <edc:SFRFieldDef edc:cname="DITHERBUF" edc:desc="Dithering Buffer Cycle Number" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="-19"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x13"/>
            <edc:AdjustPoint edc:offset="-18"/>
            <edc:SFRFieldDef edc:cname="CCBUF" edc:desc="Channel Compare/Capture Buffer Value" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x41000000" edc:endaddr="0x41014028" edc:regionid="PBB" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x41000000" edc:access="ww-www-w" edc:cname="CTRL" edc:impl="0xDD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC" edc:desc="32-bit Cyclic Redundancy Code" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MBIST" edc:desc="Memory built-in self-test" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CE" edc:desc="Chip-Erase" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ARR" edc:desc="Auxiliary Row Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMSA" edc:desc="Start Memory Stream Access" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000001" edc:access="---nnnnn" edc:cname="STATUSA" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Done" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRSTEXT" edc:desc="CPU Reset Phase Extension" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BERR" edc:desc="Bus Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAIL" edc:desc="Failure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="Protection Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000002" edc:access="rrrrrrrr" edc:cname="STATUSB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PROT" edc:desc="Protected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBGPRES" edc:desc="Debugger Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCCD0" edc:desc="Debug Communication Channel 0 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCCD1" edc:desc="Debug Communication Channel 1 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPE" edc:desc="Hot-Plugging Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CELCK" edc:desc="Chip Erase Locked" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCCD0" edc:desc="Test Debug Communication Channel 0 Dirty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCCD1" edc:desc="Test Debug Communication Channel 1 Dirty" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
