Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x41006025" edc:access="------nn" edc:cname="CHANNEL0CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006026" edc:access="------nn" edc:cname="CHANNEL0CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006027" edc:access="------rr" edc:cname="CHANNEL0CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006028" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL1CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONOUS" edc:desc="Synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESYNCHRONIZED" edc:desc="Resynchronized path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCHRONOUS" edc:desc="Asynchronous path" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_EVT_OUTPUT" edc:desc="No event output when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_EDGE" edc:desc="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING_EDGE" edc:desc="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH_EDGES" edc:desc="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100602C" edc:access="------nn" edc:cname="CHANNEL1CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100602D" edc:access="------nn" edc:cname="CHANNEL1CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100602E" edc:access="------nn" edc:cname="CHANNEL1CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100602F" edc:access="------rr" edc:cname="CHANNEL1CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006030" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL2CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONOUS" edc:desc="Synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESYNCHRONIZED" edc:desc="Resynchronized path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCHRONOUS" edc:desc="Asynchronous path" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NO_EVT_OUTPUT" edc:desc="No event output when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_EDGE" edc:desc="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING_EDGE" edc:desc="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH_EDGES" edc:desc="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41006034" edc:access="------nn" edc:cname="CHANNEL2CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
