Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x41011010" edc:access="-----------------------rrrrrrrrr" edc:cname="ARB_CORE_STATUS" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="ARB_CORE_STATE" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CUR_RADIO_OWNER" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CUR_REQ_PRI" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41011014" edc:access="--------------------------nnnnnn" edc:cname="ARB_INT_STATUS" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="BT_ABORT_HIZB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_ABORT_HIBT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_RADIO_TO_ABRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_RADIO_TO_ABRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_TIMESENSE_REQ_LOSS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_TIMESENSE_REQ_LOSS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41011018" edc:access="--------------------------nnnnnn" edc:cname="ARB_INT_MASK" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ARB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ARB">
            <edc:SFRFieldDef edc:cname="BT_ABORT_HIZB_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_ABORT_HIBT_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_RADIO_TO_ABRT_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_RADIO_TO_ABRT_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BT_TIMESENSE_REQ_LOSS_MSK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ZB_TIMESENSE_REQ_LOSS_MSK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4101101C" edc:offset="0x149C"/>
      <edc:SFRDef edc:_addr="0x410124B8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DPLL_RG1" edc:nzwidth="0x10" ltx:memberofperipheral="BLE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BLE">
            <edc:SFRFieldDef edc:cname="DPLL_RG1BITS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410124BA" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DPLL_RG2" edc:nzwidth="0x10" ltx:memberofperipheral="BLE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BLE">
            <edc:SFRFieldDef edc:cname="DPLL_RG2BITS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x410124BC" edc:offset="0x1B44"/>
      <edc:SFRDef edc:_addr="0x41014000" edc:access="-----------nnnnn---------nnnn-nn" edc:cname="SUBSYS_CNTRL_REG0" edc:impl="0x1F007B" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="BTZBSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="zb_slp_ctrl" edc:desc="zb_slp_ctrl" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_soft_reset_in" edc:desc="zb_soft_reset_in" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_reset_by_fw" edc:desc="zb_reset_by_fw" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_en_main_clk" edc:desc="zb_en_main_clk" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ant_div_sel_1_iom_en" edc:desc="ant_div_sel_1_iom_en" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ant_div_sel_2_iom_en" edc:desc="ant_div_sel_2_iom_en" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="bt_pdc_ov" edc:desc="bt_pdc_ov" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="bt_sfr_wakeup_bit" edc:desc="bt_sfr_wakeup_bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="bt_hw_rc_re_cal" edc:desc="bt_hw_rc_re_cal" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="bt_reset_by_fw" edc:desc="bt_reset_by_fw" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="bt_en_main_clk" edc:desc="bt_en_main_clk" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41014004" edc:access="--------nnnnnnnnnnnn--nnnnnnnnnn" edc:cname="SUBSYS_CNTRL_REG1" edc:impl="0xFFF3FF" edc:mclr="00000000000000001111000000000000" edc:nzwidth="0x20" edc:por="00000000000000001111000000000000" ltx:memberofperipheral="BTZBSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_sel_top" edc:desc="subsys_dbg_bus_sel_top" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="subsys_dbg_bus_sel" edc:desc="subsys_dbg_bus_sel" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="subsys_clk_src_sel" edc:desc="subsys_clk_src_sel" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ssubsys_clk_div_sel" edc:desc="subsys_clk_div_sel" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="subsys_bypass_xtal_ready" edc:desc="subsys_bypass_xtal_ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="subsys_bypass_pll_lock" edc:desc="subsys_bypass_pll_lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="subsys_xtal_ready_delay" edc:desc="subsys_xtal_ready_delay" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="tr_sw_iom_en" edc:desc="tr_sw_iom_en" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="tr_sw_n_iom_en" edc:desc="tr_sw_n_iom_en" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="pa_on_iom_en" edc:desc="pa_on_iom_en" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="lna_on_iom_en" edc:desc="lna_on_iom_en" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_bt_bar_ovrd_en" edc:desc="zb_bt_bar_ovrd_en" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_bt_bar_ovrd_val" edc:desc="zb_bt_bar_ovrd_val" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="invert_btadc_clk" edc:desc="invert_btadc_clk" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="clk_lp_req" edc:desc="clk_lp_req" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41014008" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x41014020" edc:access="--------------nn-------------nnn" edc:cname="SUBSYS_STATUS_REG0" edc:impl="0x30007" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="BTZBSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="zb_sleep_mode" edc:desc="zb_sleep_mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="zb_deep_sleep_mode" edc:desc="zb_deep_sleep_mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="radio_idle_zb" edc:desc="radio_idle_zb" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="bt_low_power_mode" edc:desc="bt_low_power_mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="bt_rf_idle" edc:desc="bt_rf_idle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41014024" edc:access="---------------------------nnnnn" edc:cname="SUBSYS_STATUS_REG1" edc:impl="0x1F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="BTZBSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="BTZBSYS">
            <edc:SFRFieldDef edc:cname="xtal_ready_out" edc:desc="xtal_ready_out" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="pll_lock_out" edc:desc="pll_lock_out" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTAL_ready" edc:desc="XTAL_ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLL_locked" edc:desc="PLL_locked" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="clk_lp_ready" edc:desc="clk_lp_ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x42000000" edc:endaddr="0x4201100C" edc:regionid="PBC" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x42000000" edc:access="-------n----------------------nn" edc:cname="CTRLA" edc:impl="0x1000003" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:desc="Last Transfer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000004" edc:access="nnnnnnnnnnnnnnnn----nnnn--nnnnnn" edc:cname="CTRLB" edc:impl="0xFFFF0F3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Serial Memory Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SPI" edc:desc="SPI operating mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEMORY" edc:desc="Serial Memory operating mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOOPEN" edc:desc="Local Loopback Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Local Loopback is disabled" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Local Loopback is enabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:desc="Wait Data Read Before Transfer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMEMREG" edc:desc="Serial Memory reg" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSMODE" edc:desc="Chip Select Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORELOAD" edc:desc="The chip select is deasserted if TD has not been reloaded before the end of the current transfer." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LASTXFER" edc:desc="The chip select is deasserted when the bit LASTXFER is written at 1 and the character written in TD has been transferred." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SYSTEMATICALLY" edc:desc="The chip select is deasserted systematically after each transfer." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DATALEN" edc:desc="Data Length" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="8BITS" edc:desc="8-bits transfer" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9BITS" edc:desc="9 bits transfer" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="10BITS" edc:desc="10-bits transfer" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="11BITS" edc:desc="11-bits transfer" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="12BITS" edc:desc="12-bits transfer" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="13BITS" edc:desc="13-bits transfer" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="14BITS" edc:desc="14-bits transfer" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="15BITS" edc:desc="15-bits transfer" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="16BITS" edc:desc="16-bits transfer" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:desc="Delay Between Consecutive Transfers" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DLYCS" edc:desc="Minimum Inactive CS Delay" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
