Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:AdjustPoint edc:_addr="0x42000024" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x42000030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="INSTRADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Instruction Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000034" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="INSTRCTRL" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="INSTR" edc:desc="Instruction Code" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="OPTCODE" edc:desc="Option Code" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000038" edc:access="-----------nnnnnnnnn-nnnnnnn-nnn" edc:cname="INSTRFRAME" edc:impl="0x1FF7F7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="WIDTH" edc:desc="Instruction Code, Address, Option Code and Data Width" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SINGLE_BIT_SPI" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_OUTPUT" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_OUTPUT" edc:desc="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_IO" edc:desc="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_IO" edc:desc="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DUAL_CMD" edc:desc="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="QUAD_CMD" edc:desc="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INSTREN" edc:desc="Instruction Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDREN" edc:desc="Address Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPTCODEEN" edc:desc="Option Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAEN" edc:desc="Data Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPTCODELEN" edc:desc="Option Code Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="1BIT" edc:desc="1-bit length option code" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2BITS" edc:desc="2-bits length option code" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="4BITS" edc:desc="4-bits length option code" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8BITS" edc:desc="8-bits length option code" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADDRLEN" edc:desc="Address Length" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="24BITS" edc:desc="24-bits address length" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="32BITS" edc:desc="32-bits address length" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TFRTYPE" edc:desc="Data Transfer Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="READ" edc:desc="Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial flash memory is not possible." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="READMEMORY" edc:desc="Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial flash memory is possible." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WRITE" edc:desc="Write transfer into the serial memory.Scrambling is not performed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="WRITEMEMORY" edc:desc="Write data transfer into the serial memory.If enabled, scrambling is performed." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CRMODE" edc:desc="Continuous Read Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DDREN" edc:desc="Double Data Rate Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUMMYLEN" edc:desc="Dummy Cycles Length" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200003C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42000040" edc:access="------------------------------nn" edc:cname="SCRAMBCTRL" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Scrambling/Unscrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RANDOMDIS" edc:desc="Scrambling/Unscrambling Random Value Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
