Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x42000044" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SCRAMBKEY" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="QSPI">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="QSPI">
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Scrambling User Key" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000048" edc:offset="0x3B8"/>
      <edc:SFRDef edc:_addr="0x42000400" edc:access="------------nnnn-nnnnnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0xF7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AESMODE" edc:desc="AES Modes of operation" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="ECB" edc:desc="Electronic code book mode" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CBC" edc:desc="Cipher block chaining mode" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFB" edc:desc="Output feedback mode" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CFB" edc:desc="Cipher feedback mode" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="COUNTER" edc:desc="Counter mode" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CCM" edc:desc="CCM mode" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCM" edc:desc="Galois counter mode" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CFBS" edc:desc="Cipher Feedback Block Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="128BIT" edc:desc="128-bit Input data block for Encryption/Decryption in Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="64BIT" edc:desc="64-bit Input data block for Encryption/Decryption in Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32BIT" edc:desc="32-bit Input data block for Encryption/Decryption in Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="16BIT" edc:desc="16-bit Input data block for Encryption/Decryption in Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="8BIT" edc:desc="8-bit Input data block for Encryption/Decryption in Cipher Feedback mode" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEYSIZE" edc:desc="Encryption Key Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="128BIT" edc:desc="128-bit Key for Encryption / Decryption" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="192BIT" edc:desc="192-bit Key for Encryption / Decryption" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="256BIT" edc:desc="256-bit Key for Encryption / Decryption" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CIPHER" edc:desc="Cipher Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DEC" edc:desc="Decryption" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENC" edc:desc="Encryption" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STARTMODE" edc:desc="Start Mode Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MANUAL" edc:desc="Start Encryption / Decryption in Manual mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="Start Encryption / Decryption in Auto mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOD" edc:desc="Last Output Data Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="Start encryption in Last Output Data mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEYGEN" edc:desc="Last Key Generation" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LAST" edc:desc="Start Computation of the last NK words of the expanded key" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="XORKEY" edc:desc="XOR Key Operation" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="XOR" edc:desc="The user keyword gets XORed with the previous keyword register content." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CTYPE" edc:desc="Counter Measure Type" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000404" edc:access="----nnnn" edc:cname="CTRLB" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start Encryption/Decryption" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NEWMSG" edc:desc="New message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EOM" edc:desc="End of message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMUL" edc:desc="GF Multiplication" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000405" edc:access="------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="ENCCMP" edc:desc="Encryption Complete Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GFMCMP" edc:desc="GF Multiplication Complete Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
