Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:AdjustPoint edc:_addr="0x440006A4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x440006B0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMDATA7" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x440006B4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x440006C0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMSRCADDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x440006C4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x440006D0" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPLT" edc:impl="0x80FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="PWPLT" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440006D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPLTCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPLTSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPLTINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006E0" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPGTE" edc:impl="0x80FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="PWPGTE" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440006E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPGTECLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006E8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPGTESET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006EC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPGTEINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM"/>
      <edc:SFRDef edc:_addr="0x440006F0" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMLBWP" edc:impl="0x80FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVM">
            <edc:SFRFieldDef edc:cname="LBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
