Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x44000844" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP1RR23" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR2" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR3" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000848" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP1RR45" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR4" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR5" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4400084C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP1RR67" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR1RR6" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P1RR7" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000850" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP2RR01" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR0" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR1" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000854" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP2RR23" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR2" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR3" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000858" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP2RR45" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR4" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR5" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4400085C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFT_VALP2RR67" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PFW">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PFW">
            <edc:SFRFieldDef edc:cname="PR2RR6" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="P2RR7" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44000860" edc:offset="0x1A0"/>
      <edc:SFRDef edc:_addr="0x44000A00" edc:access="-----nnnn-n-----nnnnnnnnn--nn-nn" edc:cname="OSCCON" edc:impl="0x7A0FF9B" edc:mclr="00000000000000000000000100000000" edc:nzwidth="0x20" edc:por="00000000000000000000000100000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="Oscillator Switch Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SWITCH" edc:desc="Request oscillator switch to selection specified by NOSC[3:0] bits" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SWITCH_COMPLETE" edc:desc="Oscillator switch is complete" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="32 kHz Secondary (LP) Oscillator Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enable Secondary Oscillator" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disable Secondary Oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="Clock Fail Detect bit (Read / writable / Clearable by application)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FAIL_DET" edc:desc="FSCM has detected clock failure" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_FAILDET" edc:desc="FSCM has not detected clock failure" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="Enable SLEEP Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="When a WAIT Instruction is executed device will enter SLEEP Mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="When a WAIT instruction is executed device will enter IDLE Mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="Clock Lock Enabled bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOCKED" edc:desc="All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UNLOCKED" edc:desc="Clock and PLL selection registers are not locked, configurations may be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NOSC" edc:desc="New Oscillator Selection bits" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SPLL" edc:desc="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="Primary Oscillator" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0xF) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="COSC" edc:desc="Current Oscillator Selection bits (Read-only)" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SPLL" edc:desc="System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="Primary Oscillator- POSC" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0xF) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:desc="2-Speed startup enabled in Sleep mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SELECTED_CLK" edc:desc="When the device EXITS Sleep Mode, the sys_clk will be from the selected clock." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRMEN" edc:desc="Enable Dream Mode bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="DMA transfer has no effect" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="Fast RC Clock Divider bits" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV_1" edc:desc="FRC Divide by 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV_2" edc:desc="FRC Divide by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV_4" edc:desc="FRC Divide by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV_8" edc:desc="FRC Divide by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV_16" edc:desc="FRC Divide by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV_32" edc:desc="FRC Divide by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV_64" edc:desc="FRC Divide by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV_256" edc:desc="FRC Divide by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000A04" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OSCCONCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A08" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OSCCONSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A0C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OSCCONINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A10" edc:access="--------------------------nnnnnn" edc:cname="OSCTUN" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="TUN" edc:desc="Internal Fast RC (FRC) Oscillator Tuning bits" edc:nzwidth="0x6">
              <edc:SFRFieldSemantic edc:cname="Max" edc:desc="Maximum Frequency" edc:when="(field &amp; 0x3F) == 0x1f"/>
              <edc:SFRFieldSemantic edc:cname="Center" edc:desc="Center Frequency, oscillator is running at calibrated frequency" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="Min" edc:desc="Minimum Frequency" edc:when="(field &amp; 0x3F) == 0x20"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000A14" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OSCTUNCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A18" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OSCTUNSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A1C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OSCTUNINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000A20" edc:access="nn----------nnnnnnnnnnnn--nnn---" edc:cname="SPLLCON" edc:impl="0xC00FFF38" edc:mclr="11000000000000000000000100001000" edc:nzwidth="0x20" edc:por="11000000000000000000000100001000" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SPLLPWDN" edc:desc="PLL Power Down Register bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PLL_OFF" edc:desc="PLL is powered down" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLL_ON" edc:desc="PLL is active" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLLFLOCK" edc:desc="System PLL Force Lock" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ASSERT" edc:desc="Force the SPLL lock signal to be asserted" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_ASSERT" edc:desc="Do not force the SPLL lock signal to be asserted" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPLLRST" edc:desc="System PLL Reset" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ASSERT" edc:desc="Assert the reset to the SPLL" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NO_ASSERT" edc:desc="De-assert the reset to the SPLL" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV1" edc:desc="SPLL Clock 1 Divide Value, 1 to 255" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV2" edc:desc="SPLL Clock 2 Divide Value, 1 to 15" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV_1" edc:desc="Second post divide by 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV_2" edc:desc="Second post divide by 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV_3" edc:desc="Second post divide by 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV_4" edc:desc="Second post divide by 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV_5" edc:desc="Second post divide by 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV_6" edc:desc="Second post divide by 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV_7" edc:desc="Second post divide by 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV_8" edc:desc="Second post divide by 8" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV_9" edc:desc="Second post divide by 9" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV_10" edc:desc="Second post divide by 10" edc:when="(field &amp; 0xF) == 0xa"/>
              <edc:SFRFieldSemantic edc:cname="DIV_11" edc:desc="Second post divide by 11" edc:when="(field &amp; 0xF) == 0xb"/>
              <edc:SFRFieldSemantic edc:cname="DIV_12" edc:desc="Second post divide by 12" edc:when="(field &amp; 0xF) == 0xc"/>
              <edc:SFRFieldSemantic edc:cname="DIV_13" edc:desc="Second post divide by 13" edc:when="(field &amp; 0xF) == 0xd"/>
              <edc:SFRFieldSemantic edc:cname="DIV_14" edc:desc="Second post divide by 14" edc:when="(field &amp; 0xF) == 0xe"/>
              <edc:SFRFieldSemantic edc:cname="DIV_15" edc:desc="Second post divide by 15" edc:when="(field &amp; 0xF) == 0xf"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="SPLL_BYP" edc:desc="SPLL Clock 2 Source" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SPLL3" edc:desc="SPLL3 (RFPLL) Clock is the clock source for ADC CP Clock Generation." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FRC" edc:desc="FRC is used as clock source for ADC CP Clock Generation." edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="POSC" edc:desc="POSC is used as clock source for ADC CP Clock Generation." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
