Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x44000B24" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO6TRIMCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B28" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO6TRIMSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B2C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="REFO6TRIMINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B30" edc:access="----------------n---n----nnnnnnn" edc:cname="PB1DIV" edc:impl="0x887F" edc:mclr="00000000000000001000100000000001" edc:nzwidth="0x20" edc:por="00000000000000001000100000000001" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="PB1 Peripheral Clock Divisor Control value" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1 PB1 Clock same frequency as sys_clk" edc:when="(field &amp; 0x7F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2 PB1 Clock is 1/2 of sys_clk" edc:when="(field &amp; 0x7F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3 PB1 Clock is 1/3 of sys_clk" edc:when="(field &amp; 0x7F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16 PB1 Clock is 1/16 of sys_clk" edc:when="(field &amp; 0x7F) == 0xf"/>
              <edc:SFRFieldSemantic edc:cname="DIV17" edc:desc="Divide by 17 PB1 Clock is 1/17 of sys_clk" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV127" edc:desc="Divide by 127 PB1 Clock is 1/127 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7e"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128 PB1 Clock is 1/128 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7f"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="PB1 Peripheral Clock Divisor Ready" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PB1RDY" edc:desc="Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOT_PB1RDY" edc:desc="Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PBDIVON" edc:desc="Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PB1ON" edc:desc="PB1 Output clock is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PB1OFF" edc:desc="PB1 Output clock is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44000B34" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB1DIVCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB1DIVSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B3C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PB1DIVINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRU"/>
      <edc:SFRDef edc:_addr="0x44000B40" edc:access="----------------n---n----nnnnnnn" edc:cname="PB2DIV" edc:impl="0x887F" edc:mclr="00000000000000001000100000000001" edc:nzwidth="0x20" edc:por="00000000000000001000100000000001" ltx:memberofperipheral="CRU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRU">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="PB2 Peripheral Clock Divisor Control value" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide by 1 PB2 Clock same frequency as sys_clk" edc:when="(field &amp; 0x7F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2 PB2 Clock is 1/2 of sys_clk" edc:when="(field &amp; 0x7F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV3" edc:desc="Divide by 3 PB2 Clock is 1/3 of sys_clk" edc:when="(field &amp; 0x7F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16 PB2 Clock is 1/16 of sys_clk" edc:when="(field &amp; 0x7F) == 0xf"/>
              <edc:SFRFieldSemantic edc:cname="DIV17" edc:desc="Divide by 17 PB2 Clock is 1/17 of sys_clk" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="DIV127" edc:desc="Divide by 127 PB2 Clock is 1/127 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7e"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide by 128 PB2 Clock is 1/128 of sys_clk" edc:when="(field &amp; 0x7F) == 0x7f"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="PB2 Peripheral Clock Divisor Ready" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PB2RDY" edc:desc="Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NOT_PB2RDY" edc:desc="Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written." edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PBDIVON" edc:desc="Output Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PB2ON" edc:desc="PB2 Output clock is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PB2OFF" edc:desc="PB2 Output clock is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
