Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x44001008" edc:access="----------------------------nnnn" edc:cname="EXTINT2R" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="EXTINT2" edc:desc="EXTINT2" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="RPA5" edc:desc="RPA5" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPA9" edc:desc="RPA9" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RPB6" edc:desc="RPB6" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="RPA4" edc:desc="RPA4" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="RPA8" edc:desc="RPA8" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="RPB5" edc:desc="RPB5" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="RPB9" edc:desc="RPB9" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0xF) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4400100C" edc:access="----------------------------nnnn" edc:cname="EXTINT3R" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="EXTINT3" edc:desc="EXTINT3" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="RPA6" edc:desc="RPA6" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPA10" edc:desc="RPA10" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RPB7" edc:desc="RPB7" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="RPA5" edc:desc="RPA5" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="RPA9" edc:desc="RPA9" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="RPB6" edc:desc="RPB6" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="RPA8" edc:desc="RPA8" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0xF) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x44001010" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x4400103C" edc:access="----------------------------nnnn" edc:cname="NMIR" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="NMI" edc:desc="NMI" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="RPA6" edc:desc="RPA6" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPA10" edc:desc="RPA10" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RPB7" edc:desc="RPB7" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="RPA5" edc:desc="RPA5" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="RPA9" edc:desc="RPA9" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="RPB6" edc:desc="RPB6" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="RPA8" edc:desc="RPA8" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0xF) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44001040" edc:access="----------------------------nnnn" edc:cname="SCOM0P0R" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="SCOM0P0" edc:desc="SERCOM0/PAD0" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="RPA4" edc:desc="RPA4" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPA8" edc:desc="RPA8" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RPB5" edc:desc="RPB5" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="RPB9" edc:desc="RPB9" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="RPA3" edc:desc="RPA3" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="RPA7" edc:desc="RPA7" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="RPB4" edc:desc="RPB4" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="RPB8" edc:desc="RPB8" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0xF) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44001044" edc:access="----------------------------nnnn" edc:cname="SCOM0P1R" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PPS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PPS">
            <edc:SFRFieldDef edc:cname="SCOM0P1" edc:desc="SERCOM0/PAD1" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="RPA5" edc:desc="RPA5" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RPA9" edc:desc="RPA9" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="RPB6" edc:desc="RPB6" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="RPA4" edc:desc="RPA4" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="RPA8" edc:desc="RPA8" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="RPB5" edc:desc="RPB5" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="RPB9" edc:desc="RPB9" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="OFF" edc:when="(field &amp; 0xF) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
