Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x44001444" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMOD1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x44001448" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMOD1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:SFRDef edc:_addr="0x4400144C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCIMOD1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS"/>
      <edc:AdjustPoint edc:_addr="0x44001450" edc:offset="0x30"/>
      <edc:SFRDef edc:_addr="0x44001480" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCGIRQEN1" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADCHS">
            <edc:SFRFieldDef edc:cname="AGIEN0" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN1" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN2" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN3" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN4" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN5" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN6" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN7" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN8" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN9" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN10" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AGIEN11" edc:desc="ADC Global Interrupt Enable bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Interrupts are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
