Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x44002254" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002258" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x4400225C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002260" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPD" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNPD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002264" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPDCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002268" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPDSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x4400226C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPDINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002270" edc:access="----------------nnn-n-----------" edc:cname="CNCON" edc:impl="0xE800" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002274" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNCONCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002278" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNCONSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x4400227C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNCONINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002280" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNEN" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNIE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002284" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNENCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002288" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNENSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x4400228C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNENINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002290" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNSTAT" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNSTAT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTAT14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002294" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNSTATCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x44002298" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNSTATSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x4400229C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNSTATINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022A0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNNE" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNNE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNE14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440022A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNNECLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNNESET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNNEINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022B0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNF" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="CNF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNF14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440022B4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNFCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022B8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNFSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022BC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNFINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022C0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="SRCON0" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="SR00" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR01" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR02" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR03" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR04" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR05" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR06" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR07" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR08" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR09" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR010" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR011" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR012" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR013" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR014" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x440022C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON0CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON0SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON0INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022D0" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="SRCON1" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOA">
            <edc:SFRFieldDef edc:cname="SR10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR110" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR111" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR112" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR113" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR114" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
