Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x440022D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON1CLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON1SET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:SFRDef edc:_addr="0x440022DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRCON1INV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOA"/>
      <edc:AdjustPoint edc:_addr="0x440022E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x44002300" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="ANSEL" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="ANS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002304" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ANSELCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002308" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ANSELSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400230C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ANSELINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002310" edc:access="-----------------nn--nnnnnnnnnnn" edc:cname="TRIS" edc:impl="0x67FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="TRIS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRIS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIS14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002314" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TRISCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002318" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TRISSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400231C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TRISINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002320" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="PORT" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="R0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="R14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002324" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002328" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400232C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PORTINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002330" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="LAT" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="LAT0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LAT14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002334" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LATCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002338" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LATSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400233C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LATINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002340" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="ODC" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="ODC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODC14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
