Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/edc/PIC32CX1012BZ24032.PIC
      <edc:SFRDef edc:_addr="0x44002344" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ODCCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002348" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ODCSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400234C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ODCINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002350" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPU" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="CNPU0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPU14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002354" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002358" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400235C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPUINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002360" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPD" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="CNPD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPD14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002364" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPDCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002368" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPDSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400236C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNPDINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002370" edc:access="----------------nnn-n-----------" edc:cname="CNCON" edc:impl="0xE800" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x44002374" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNCONCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002378" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNCONSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x4400237C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CNCONINV" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB"/>
      <edc:SFRDef edc:_addr="0x44002380" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNEN" edc:impl="0x7FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GPIOB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPIOB">
            <edc:SFRFieldDef edc:cname="CNIE0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE14" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
